"""
задача,создать полноценный бэкенд для просмотра фильмов и сериалов
Создать API, которое позволит пользователям просматривать список фильмов и сериалов,
получать подробную информацию о них,
а также смотреть фильмы через предоставленные ссылки на стриминговые сервисы или встроенные видео.

там должно быть
авторизация,аутентификация
подписка
просмотр фильмов
просмотров всех фильмов

задача,создать верификация по почте ,для этого накидал такую идею,у пользователя добавляем поле sms
который хранит данные про него(sms данные),потом при регистраций ,отправляем это на почту и если юзер примет это
он должен по определенному endpoint его ввести и получить активацию
"""